#+title: Readme

- [[elisp:(vterm-nixos-config)][Launch terminal for config]]
-----
- [[elisp:(org-babel-tangle)][Tangle file]]
- [[elisp:(dl/nixos-update-all-config)][Update all config]]
- [[elisp:(dl/nixos-update-user-config)][Update home config]]
- [[elisp:(dl/nixos-update-system-config)][Update system config]]
-------
- [[elisp:(dl/nixos-try-package)][Try package]]
- [[*System Packages][configuration.nix packages]]
- [[*home.nix packages inbox][home.nix packages]]
- [[id:93410304-5af5-429b-ab09-18892f0950bc][Nix tasks]]
* Nixos Terminal
#+begin_src elisp
(defun vterm-nixos-config ()
  "Switch to or create a vterm in ~/.dotfiles/."
  (interactive)
  (let ((buffer-name "*nixos-config-vterm*")
        (dotfiles-dir "~/.dotfiles/"))
    (if (get-buffer buffer-name)
        (switch-to-buffer buffer-name)
      (let ((default-directory (expand-file-name dotfiles-dir)))
        (vterm buffer-name)
        ))))
(vterm-nixos-config)
#+end_src

#+RESULTS:
: #<buffer *nixos-config-vterm*>
#+begin_src emacs-lisp
(defun dl/nixos-send-string-to-nixos-vterm (str)
  (vterm-nixos-config)
  (vterm-send-string str)
  (vterm-send-return))

(defun dl/nixos-populate-string-nixos-vterm (str)
  (vterm-nixos-config)
  (vterm-send-string str))
#+end_src

#+RESULTS:
: dl/nixos-update-home-config


